cmsis-svd/cmsis-svd/data/Holtek/HT32F12365_66.svd
        <!--IP1-->
        <register>
          <name>IP1</name>
          <displayName>IP1</displayName>
          <description>IP1</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_4</name>
              <description>PRI_4</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_5</name>
              <description>PRI_5</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_6</name>
              <description>PRI_6</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_7</name>
              <description>PRI_7</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP2-->
        <register>
          <name>IP2</name>
          <displayName>IP2</displayName>
          <description>IP2</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_8</name>
              <description>PRI_8</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_9</name>
              <description>PRI_9</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_10</name>
              <description>PRI_10</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_11</name>
              <description>PRI_11</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP3-->
        <register>
          <name>IP3</name>
          <displayName>IP3</displayName>
          <description>IP3</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_12</name>
              <description>PRI_12</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_13</name>
              <description>PRI_13</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_14</name>
              <description>PRI_14</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_15</name>
              <description>PRI_15</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP4-->
        <register>
          <name>IP4</name>
          <displayName>IP4</displayName>
          <description>IP4</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_16</name>
              <description>PRI_16</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_17</name>
              <description>PRI_17</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_18</name>
              <description>PRI_18</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_19</name>
              <description>PRI_19</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
