cmsis-svd/cmsis-svd/data/Holtek/HT32F12365_66.svd
        <!--IP5-->
        <register>
          <name>IP5</name>
          <displayName>IP5</displayName>
          <description>IP5</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_20</name>
              <description>PRI_20</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_21</name>
              <description>PRI_21</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_22</name>
              <description>PRI_22</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_23</name>
              <description>PRI_23</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP6-->
        <register>
          <name>IP6</name>
          <displayName>IP6</displayName>
          <description>IP6</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_24</name>
              <description>PRI_24</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_25</name>
              <description>PRI_25</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_26</name>
              <description>PRI_26</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_27</name>
              <description>PRI_27</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP7-->
        <register>
          <name>IP7</name>
          <displayName>IP7</displayName>
          <description>IP7</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_28</name>
              <description>PRI_28</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_29</name>
              <description>PRI_29</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_30</name>
              <description>PRI_30</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_31</name>
              <description>PRI_31</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP8-->
        <register>
          <name>IP8</name>
          <displayName>IP8</displayName>
          <description>IP8</description>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_32</name>
              <description>PRI_32</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_33</name>
              <description>PRI_33</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_34</name>
              <description>PRI_34</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_35</name>
              <description>PRI_35</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
