cmsis-svd/cmsis-svd/data/Holtek/HT32F12365_66.svd
      </registers>
    </peripheral>
    <!--AFIO-->
    <peripheral>
      <name>AFIO</name>
      <version>1.0</version>
      <description>AFIO</description>
      <groupName>AFIO</groupName>
      <baseAddress>0x40022000</baseAddress>
      <size>32</size>
      <!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <!--Bytes-->
        <usage>registers</usage>
        <!--registers/buffer/reserved-->
      </addressBlock>
      <registers>
        <!--AFIO_ESSR0-->
        <register>
          <name>AFIO_ESSR0</name>
          <displayName>AFIO_ESSR0</displayName>
          <description>AFIO_ESSR0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>EXTI0PIN</name>
              <description>EXTI0PIN</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI1PIN</name>
              <description>EXTI1PIN</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI2PIN</name>
              <description>EXTI2PIN</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI3PIN</name>
              <description>EXTI3PIN</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI4PIN</name>
              <description>EXTI4PIN</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI5PIN</name>
              <description>EXTI5PIN</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI6PIN</name>
              <description>EXTI6PIN</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI7PIN</name>
              <description>EXTI7PIN</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--AFIO_ESSR1-->
        <register>
          <name>AFIO_ESSR1</name>
          <displayName>AFIO_ESSR1</displayName>
          <description>AFIO_ESSR1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>EXTI8PIN</name>
              <description>EXTI8PIN</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI9PIN</name>
              <description>EXTI9PIN</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI10PIN</name>
              <description>EXTI10PIN</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI11PIN</name>
              <description>EXTI11PIN</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI12PIN</name>
              <description>EXTI12PIN</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI13PIN</name>
              <description>EXTI13PIN</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI14PIN</name>
              <description>EXTI14PIN</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>EXTI15PIN</name>
              <description>EXTI15PIN</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--AFIO_GPACFGLR-->
        <register>
          <name>AFIO_GPACFGLR</name>
          <displayName>AFIO_GPACFGLR</displayName>
          <description>AFIO_GPACFGLR</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PACFG0</name>
              <description>PACFG0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG1</name>
              <description>PACFG1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG2</name>
              <description>PACFG2</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG3</name>
              <description>PACFG3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG4</name>
              <description>PACFG4</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG5</name>
              <description>PACFG5</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG6</name>
              <description>PACFG6</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG7</name>
              <description>PACFG7</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--AFIO_GPACFGHR-->
        <register>
          <name>AFIO_GPACFGHR</name>
          <displayName>AFIO_GPACFGHR</displayName>
          <description>AFIO_GPACFGHR</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PACFG8</name>
              <description>PACFG8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG9</name>
              <description>PACFG9</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG10</name>
              <description>PACFG10</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG11</name>
              <description>PACFG11</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG12</name>
              <description>PACFG12</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG13</name>
              <description>PACFG13</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG14</name>
              <description>PACFG14</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PACFG15</name>
              <description>PACFG15</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--AFIO_GPBCFGLR-->
        <register>
          <name>AFIO_GPBCFGLR</name>
          <displayName>AFIO_GPBCFGLR</displayName>
          <description>AFIO_GPBCFGLR</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PBCFG0</name>
              <description>PBCFG0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG1</name>
              <description>PBCFG1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG2</name>
              <description>PBCFG2</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG3</name>
              <description>PBCFG3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG4</name>
              <description>PBCFG4</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG5</name>
              <description>PBCFG5</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG6</name>
              <description>PBCFG6</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG7</name>
              <description>PBCFG7</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--AFIO_GPBCFGHR-->
        <register>
          <name>AFIO_GPBCFGHR</name>
          <displayName>AFIO_GPBCFGHR</displayName>
          <description>AFIO_GPBCFGHR</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PBCFG8</name>
              <description>PBCFG8</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG9</name>
              <description>PBCFG9</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG10</name>
              <description>PBCFG10</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG11</name>
              <description>PBCFG11</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG12</name>
              <description>PBCFG12</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG13</name>
              <description>PBCFG13</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG14</name>
              <description>PBCFG14</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PBCFG15</name>
              <description>PBCFG15</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
