cmsis-svd/cmsis-svd/data/Holtek/HT32F12365_66.svd
      </registers>
    </peripheral>
    <!--EXTI-->
    <peripheral>
      <name>EXTI</name>
      <version>1.1</version>
      <description>EXTI</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x40024000</baseAddress>
      <size>32</size>
      <!--Bits-->
      <resetValue>0x00000000</resetValue>
      <resetMask>0xffffffff</resetMask>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>4096</size>
        <!--Bytes-->
        <usage>registers</usage>
        <!--registers/buffer/reserved-->
      </addressBlock>
      <interrupt>
        <name>EVWUP</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>EXTI0</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>EXTI1</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>EXTI2</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>EXTI3</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>EXTI4</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>EXTI5</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>EXTI6</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>EXTI7</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>EXTI8</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>EXTI9</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>EXTI10</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>EXTI11</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>EXTI12</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>EXTI13</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>EXTI14</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>EXTI15</name>
        <value>23</value>
      </interrupt>
      <registers>
        <!--EXTI_CFGR0-->
        <register>
          <name>EXTI_CFGR0</name>
          <displayName>EXTI_CFGR0</displayName>
          <description>EXTI_CFGR0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR1-->
        <register>
          <name>EXTI_CFGR1</name>
          <displayName>EXTI_CFGR1</displayName>
          <description>EXTI_CFGR1</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR2-->
        <register>
          <name>EXTI_CFGR2</name>
          <displayName>EXTI_CFGR2</displayName>
          <description>EXTI_CFGR2</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--EXTI_CFGR3-->
        <register>
          <name>EXTI_CFGR3</name>
          <displayName>EXTI_CFGR3</displayName>
          <description>EXTI_CFGR3</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DBCNT</name>
              <description>DBCNT</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCTYPE</name>
              <description>SRCTYPE</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DBEN</name>
              <description>DBEN</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
