cmsis-svd/cmsis-svd/data/Holtek/HT32F12365_66.svd
        <!--ADC_DR3-->
        <register>
          <name>ADC_DR3</name>
          <displayName>ADC_DR3</displayName>
          <description>ADC_DR3</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADD3</name>
              <description>ADD3</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADVLD3</name>
              <description>ADVLD3</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_DR4-->
        <register>
          <name>ADC_DR4</name>
          <displayName>ADC_DR4</displayName>
          <description>ADC_DR4</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADD4</name>
              <description>ADD4</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADVLD4</name>
              <description>ADVLD4</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_DR5-->
        <register>
          <name>ADC_DR5</name>
          <displayName>ADC_DR5</displayName>
          <description>ADC_DR5</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADD5</name>
              <description>ADD5</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADVLD5</name>
              <description>ADVLD5</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_DR6-->
        <register>
          <name>ADC_DR6</name>
          <displayName>ADC_DR6</displayName>
          <description>ADC_DR6</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADD6</name>
              <description>ADD6</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADVLD6</name>
              <description>ADVLD6</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_DR7-->
        <register>
          <name>ADC_DR7</name>
          <displayName>ADC_DR7</displayName>
          <description>ADC_DR7</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADD7</name>
              <description>ADD7</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADVLD7</name>
              <description>ADVLD7</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--ADC_DR8-->
        <register>
          <name>ADC_DR8</name>
          <displayName>ADC_DR8</displayName>
          <description>ADC_DR8</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>ADD8</name>
              <description>ADD8</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>ADVLD8</name>
              <description>ADVLD8</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
