cmsis-svd/cmsis-svd/data/Holtek/HT32F12365_66.svd
        <!--PDMA_CH4CR-->
        <register>
          <name>PDMA_CH4CR</name>
          <displayName>PDMA_CH4CR</displayName>
          <description>PDMA_CH4CR</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CHEN</name>
              <description>CHEN</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SWTRIG</name>
              <description>SWTRIG</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DWIDTH</name>
              <description>DWIDTH</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DSTAINC</name>
              <description>DSTAINC</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>DSTAMOD</name>
              <description>DSTAMOD</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCAINC</name>
              <description>SRCAINC</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>SRCAMOD</name>
              <description>SRCAMOD</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CHPRI</name>
              <description>CHPRI</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>FIXAEN</name>
              <description>FIXAEN</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>AUTORL</name>
              <description>AUTORL</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PDMA_CH4SADR-->
        <register>
          <name>PDMA_CH4SADR</name>
          <displayName>PDMA_CH4SADR</displayName>
          <description>PDMA_CH4SADR</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>SADR</name>
              <description>SADR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PDMA_CH4DADR-->
        <register>
          <name>PDMA_CH4DADR</name>
          <displayName>PDMA_CH4DADR</displayName>
          <description>PDMA_CH4DADR</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>DADR</name>
              <description>DADR</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PDMA_CH4CADR-->
        <register>
          <name>PDMA_CH4CADR</name>
          <displayName>PDMA_CH4CADR</displayName>
          <description>PDMA_CH4CADR</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>CDADR</name>
              <description>CDADR</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>CSADR</name>
              <description>CSADR</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--PDMA_CH4TSR-->
        <register>
          <name>PDMA_CH4TSR</name>
          <displayName>PDMA_CH4TSR</displayName>
          <description>PDMA_CH4TSR</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <!--Bits-->
          <access>read-write</access>
          <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>BLKLEN</name>
              <description>BLKLEN</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>BLKCNT</name>
              <description>BLKCNT</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
